# ETL (Extract, Transform and Load)
## Trabalho Final | Prática | Grupo G
Base de dados usada: https://www.kaggle.com/datasets/whenamancodes/popular-movies-datasets-58000-movies?select=tags.csv'

Slide: [Canva](https://www.canva.com/design/DAFYb14LbAA/J_Kk7ndEoZM1m3Tw_glTIA/edit?utm_content=DAFYb14LbAA&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton)

|Alunos|Matrícula|
|--|--|
|Victor Buendia Cruz De Alvim|19/0020601|
|Lucas Ursulino Boaventura|18/0114093|
|Yudi Yamane de Azevedo|16/0149410|

##  ⚙️ Setup ===========================

In [1]:
pip install opendatasets pandas pandasql findspark pyspark sqlalchemy ipython-sql psycopg2 --quiet

[notice] A new release of pip available: 22.3.1 -> 23.0
[notice] To update, run: python3.10 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
from pandasql import sqldf
import opendatasets as od
import pandas
import os
import re
import sqlalchemy

In [3]:
import findspark
findspark.init()
from pyspark.context import SparkContext
from pyspark.sql.session import SparkSession
sc = SparkContext('local')
spark = SparkSession(sc)
# spark = SparkSession.builder \
#     .master('local[*]') \
#     .config("spark.driver.memory", "15g") \
#     .appName('my-cool-app') \
#     .getOrCreate()
# spark = SparkSession.builder.master("local[*]").config("spark.driver.memory", "15g").getOrCreate()
# spark = SparkSession.builder \
#     .appName("GBT Model") \
#     .config("spark.executor.memory", "4000mb") \
#     .config("spark.driver.memory", "15g") \
#     .master("local[*]") \
#     .config("spark.executor.cores", "4") \
#     .config("spark.executor.memoryOverhead",200) \
#     .config("spark.serializer", "org.apache.spark.serializer.KryoSerializer") \
#     .config("spark.default.parallelism", "4") \
#     .config("spark.kryoserializer.buffer.max", "2000mb") \
#     .getOrCreate()

23/02/08 12:53:33 WARN Utils: Your hostname, Victors-MacBook-Pro.local resolves to a loopback address: 127.0.0.1; using 192.168.1.8 instead (on interface en0)
23/02/08 12:53:33 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

23/02/08 12:53:34 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [4]:
db = sqlalchemy.create_engine('postgresql://diqquvbkvxsebz:b92a9ea92ee38e17e3da5ca9116fd4ba2492784cd1675f017103ce8c6a29fc76@ec2-34-207-12-160.compute-1.amazonaws.com:5432/d7fdq9nknhq43j')

In [5]:
from pyspark.sql import functions as F
from pyspark.sql import types as T

## ⬇️ Extract =============================

In [6]:
if not os.path.exists('./popular-movies-datasets-58000-movies/'):
    kaggleAPI = input('[TOKEN API] Insire seu Token API do Kaggle:')

    fp = open('kaggle.json', 'w')
    fp.write(kaggleAPI)
    fp.close()

    od.download(
        'https://www.kaggle.com/datasets/whenamancodes/popular-movies-datasets-58000-movies?select=tags.csv')

    os.remove('kaggle.json')

In [7]:
csvs = {}
for dirname, _, filenames in os.walk('./popular-movies-datasets-58000-movies/'):
    for filename in filenames:
        csvs[filename] = os.path.join(dirname, filename)
        print(os.path.join(dirname, filename))

./popular-movies-datasets-58000-movies/links.csv
./popular-movies-datasets-58000-movies/tags.csv
./popular-movies-datasets-58000-movies/genome-tags.csv
./popular-movies-datasets-58000-movies/ratings.csv
./popular-movies-datasets-58000-movies/genome-scores.csv
./popular-movies-datasets-58000-movies/movies.csv

In [8]:
dfs = {}

for filename in csvs:
    file=(csvs[filename])
    newData = spark.read.format("csv").option("header","true").load(file)
    dfs[re.sub('-', '_', re.findall("(.+).csv", filename)[0])] = newData
    newData.createOrReplaceTempView(re.sub('-', '_', re.findall("(.+).csv", filename)[0]))

In [9]:
for df in dfs:
    print(df,'\n |-->', dfs[df], '\n')

links
 |--> DataFrame[movieId: string, imdbId: string, tmdbId: string]

tags
 |--> DataFrame[userId: string, movieId: string, tag: string, timestamp: string]

genome_tags
 |--> DataFrame[tagId: string, tag: string]

ratings
 |--> DataFrame[userId: string, movieId: string, rating: string, timestamp: string]

genome_scores
 |--> DataFrame[movieId: string, tagId: string, relevance: string]

movies
 |--> DataFrame[movieId: string, title: string, genres: string]

# ✨ Transform =========================

In [9]:
def sqlR(sql):
    return (spark.sql(sql).toPandas())

def tView(sql, name):
    spark.sql(sql).createOrReplaceTempView(name)

---
## Movies

In [11]:
spark.table('movies')\
.withColumn('genres', F.split(spark.table('movies')['genres'], '\|'))\
.withColumn('publish_year', F.when(F.regexp_extract(F.col('title'), '\((\d\d\d\d)\)', 1) == '', None)\
                             .otherwise(F.regexp_extract(F.col('title'), '\((\d\d\d\d)\)', 1)))\
.withColumn('title', F.when(F.trim(F.regexp_extract(F.col('title'), '(.+)\(\d\d\d\d\)$', 1))\
                           == '', F.col('title'))\
                           .otherwise(F.trim(F.regexp_extract(F.col('title'), '(.+)\(\d\d\d\d\)$', 1))))\
.createOrReplaceTempView('movies')

sql = """
    SELECT * FROM movies
"""

sqlR(sql)

,movieId,title,genres,publish_year
0,1,Toy Story,"[Adventure, Animation, Children, Comedy, Fantasy]",1995
1,2,Jumanji,"[Adventure, Children, Fantasy]",1995
2,3,Grumpier Old Men,"[Comedy, Romance]",1995
3,4,Waiting to Exhale,"[Comedy, Drama, Romance]",1995
4,5,Father of the Bride Part II,[Comedy],1995
...,...,...,...,...
58093,193876,The Great Glinka,[(no genres listed)],1946
58094,193878,Les tribulations d'une caissière,[Comedy],2011
58095,193880,Her Name Was Mumu,[Drama],2016
58096,193882,Flora,"[Adventure, Drama, Horror, Sci-Fi]",2017
58097,193886,Leal,"[Action, Crime, Drama]",2018

In [12]:
sql = """

WITH M AS (
    SELECT
        M.movieId
        , M.title
        , M.genres
        , M.publish_year
        , SUM(R.rating)/COUNT(R.rating) AS average_rating
        , COUNT(DISTINCT R.userId) AS user_review_amount
        , COUNT(R.rating) AS review_amount
    FROM
        movies AS M
    LEFT JOIN
        ratings AS R
        ON TRUE
            AND M.movieId = R.movieId
    GROUP BY
        1,2,3,4
)

SELECT * FROM M


"""

tView(sql, 'movie_reviews')
sqlR(sql)

,movieId,title,genres,publish_year,average_rating,user_review_amount,review_amount
0,100010,Battle of Los Angeles,"[Action, Sci-Fi]",2011,2.478261,46,46
1,100060,Sunny (Sseo-ni),[Drama],2011,3.645161,31,31
2,100062,My Way (Mai Wei),"[Action, Drama, War]",2011,3.621622,37,37
3,100068,Comme un chef,[Comedy],2012,3.568627,102,102
4,100070,Punching the Clown,[Comedy],2009,3.538462,13,13
...,...,...,...,...,...,...,...
58093,990,Maximum Risk,"[Action, Adventure, Thriller]",1996,2.731707,984,984
58094,99043,Trishna,[Drama],2011,3.153846,13,13
58095,99566,"True Meaning of Christmas Specials, The",[Comedy],2002,3.500000,1,1
58096,99600,"Man Who Haunted Himself, The","[Drama, Fantasy, Horror, Mystery, Thriller]",1970,3.300000,5,5
58097,99960,Nursery University,[Documentary],2008,4.166667,6,6

In [13]:
sql = """

WITH M AS (
    SELECT
        M.movieId
        , M.title
        , M.genres
        , M.publish_year
        , COUNT(DISTINCT T.userId) AS user_tag_amount
        , COUNT(T.tag) AS tag_amount
        , ARRAY_AGG(DISTINCT T.tag) AS tags
    FROM
        movies AS M
    LEFT JOIN
        tags AS T
        ON TRUE
            AND T.movieId = M.movieId
    GROUP BY
        1,2,3,4
)

SELECT * FROM M


"""

tView(sql, 'movie_tags')
sqlR(sql)

,movieId,title,genres,publish_year,user_tag_amount,tag_amount,tags
0,100,City Hall,"[Drama, Thriller]",1996,9,20,"[undercover agent, investigation, presidential..."
1,100006,First Daughter,"[Comedy, Romance, Thriller]",1999,1,5,"[kidnapping, President, POTUS, spoiled brat, w..."
2,100010,Battle of Los Angeles,"[Action, Sci-Fi]",2011,4,14,"[los angeles, spaceship, alien, shootout, horr..."
3,100013,Jason Becker: Not Dead Yet,[Documentary],2012,5,13,"[heavy metal, disease, lou gehrig's disease, A..."
4,100015,Chicago Massacre: Richard Speck,"[Crime, Drama, Thriller]",2007,0,0,[]
...,...,...,...,...,...,...,...
58093,99873,Jesse Stone: Innocents Lost,"[Crime, Drama]",2011,5,10,"[Dick Lowry, prostitution, cop, Tom Selleck, f..."
58094,99893,Sangre de mi sangre (Padre Nuestro),"[Drama, Thriller]",2007,0,0,[]
58095,99906,Renoir,"[Drama, Romance]",2012,5,16,"[War times, famous painting, Nudity (Topless),..."
58096,99910,"Last Stand, The","[Action, Crime, Thriller]",2013,18,93,"[stylized violence, fbi, violent, bloody, Acti..."
58097,99915,"Candidate, The (Kandidaten)",[Thriller],2008,0,0,[]

In [14]:
sql = """

SELECT
    M.movieId
    , M.title
    , M.genres
    , M.publish_year
    , MT.user_tag_amount
    , MT.tag_amount
    , MT.tags
    , MR.average_rating
    , MR.user_review_amount
    , MR.review_amount
FROM
    movies AS M
LEFT JOIN
    movie_reviews AS MR
    ON TRUE
        AND M.movieId = MR.movieId
LEFT JOIN
    movie_tags AS MT
    ON TRUE
        AND M.movieId = MT.movieId
ORDER BY
    M.title


"""


tView(sql, 'movies_df')
sqlR(sql)

,movieId,title,genres,publish_year,user_tag_amount,tag_amount,tags,average_rating,user_review_amount,review_amount
0,51372,"""""""Great Performances"""" Cats (1998)""",[Musical],1998,3,10,"[slow motion, BD-R, Andrew Lloyd Webber, music...",2.815556,225,225
1,7789,"""11'09""""01 - September 11 (2002)""",[Drama],2002,6,15,"[9/11, woman director, library, elderly, skysc...",3.367424,132,132
2,112809,"""Diebuster """"Top wo Narae 2"""" (2004)""","[Action, Animation, Drama, Sci-Fi]",2004,2,5,"[anime, Gainax, Mecha, Sci-Fi]",3.375000,12,12
3,174029,"""Divers at Work on the Wreck of the """"Maine"""" ...",[(no genres listed)],1898,1,3,"[docudrama, diver, silent film]",3.000000,3,3
4,182853,"""How Viktor """"The Garlic"""" Took Alexey """"The S...",[Drama],2017,2,4,"[foreign, russian, black humor]",3.718750,32,32
...,...,...,...,...,...,...,...,...,...,...
58093,159678,…And the Fifth Horseman Is Fear,"[Drama, War]",1965,0,0,[],3.250000,2,2
58094,132604,キサラギ,"[Comedy, Mystery]",2007,1,2,"[small room, comedy]",3.666667,3,3
58095,132319,チェブラーシカ,"[Animation, Children]",2010,1,4,"[talking animals, puppet, USSR, Russian]",3.150000,10,10
58096,130640,貞子3D,[Horror],2012,2,7,"[vengeful ghost, ringu, online, onryo-dead gir...",2.136364,11,11
58097,157314,줄탁동시,[(no genres listed)],2012,1,1,[asian],4.000000,2,2

In [15]:
sql = """

SELECT
    M.movieId
    , L.imdbId
    , L.tmdbId
    , M.title
    , M.genres
    , M.publish_year
    , M.user_tag_amount
    , M.tag_amount
    , M.tags
    , M.average_rating
    , M.user_review_amount
    , M.review_amount
FROM
    movies_df AS M
LEFT JOIN
    links AS L
    ON TRUE
        AND M.movieId = L.movieId

"""


tView(sql, 'movies')
sqlR(sql)

,movieId,imdbId,tmdbId,title,genres,publish_year,user_tag_amount,tag_amount,tags,average_rating,user_review_amount,review_amount
0,100010,1758570,59197,Battle of Los Angeles,"[Action, Sci-Fi]",2011,4,14,"[los angeles, spaceship, alien, shootout, horr...",2.478261,46,46
1,100060,1937339,77117,Sunny (Sseo-ni),[Drama],2011,3,5,"[experimental, bullying, gang, Korea, netflix ...",3.645161,31,31
2,100062,1606384,94047,My Way (Mai Wei),"[Action, Drama, War]",2011,1,1,[world war ii],3.621622,37,37
3,100068,1911553,85872,Comme un chef,[Comedy],2012,4,5,"[Michael Youn, cooking, funny]",3.568627,102,102
4,100070,1192624,47863,Punching the Clown,[Comedy],2009,2,5,"[comedy, struggling career, comedian, good hum...",3.538462,13,13
...,...,...,...,...,...,...,...,...,...,...,...,...
58093,99600,0066053,4910,"Man Who Haunted Himself, The","[Drama, Fantasy, Horror, Mystery, Thriller]",1970,2,7,"[ghost, madness, car crash, cult film, reality...",3.300000,5,5
58094,99675,2085002,127901,Eat Sleep Die (Äta sova dö),[Drama],2012,4,7,"[realistic, immigrants, Gabriela Pichler, work...",3.736842,19,19
58095,99811,1931388,97610,Beware of Mr. Baker,[Documentary],2012,4,9,"[rock and roll, drums, Life Story, drummer, Ja...",3.641509,53,53
58096,99901,1869593,None,O Panishyros Megistanas Ton Ninja,"[Action, Comedy, Sci-Fi]",2008,1,3,"[funny, low budget, cult]",2.125000,4,4
58097,99960,1213832,23976,Nursery University,[Documentary],2008,1,4,"[education, new york, private school, independ...",4.166667,6,6

In [16]:
movies = spark.sql('SELECT * FROM movies;').collect()

---
## Ratings

In [18]:
spark.table('ratings')\
.withColumn('dt', F.to_date(F.col('timestamp')\
                            .cast('bigint')\
                            .cast(dataType=T.TimestampType()), 'yyyy-MM-dd HH:mm:ss') )\
.withColumn('timestamp', F.col('timestamp')\
                            .cast('bigint')\
                            .cast(dataType=T.TimestampType()) )\
.createOrReplaceTempView('ratings')

sql = """

SELECT
    *
FROM
    ratings
"""


tView(sql, 'ratings')
sqlR(sql)

/opt/homebrew/lib/python3.10/site-packages/pyspark/sql/pandas/conversion.py:248: FutureWarning: Passing unit-less datetime64 dtype to .astype is deprecated and will raise in a future version. Pass 'datetime64[ns]' instead
  series = series.astype(t, copy=False)

          userId movieId rating           timestamp          dt
0              1     307    3.5 2009-10-27 19:00:21  2009-10-27
1              1     481    3.5 2009-10-27 19:04:16  2009-10-27
2              1    1091    1.5 2009-10-27 19:04:31  2009-10-27
3              1    1257    4.5 2009-10-27 19:04:20  2009-10-27
4              1    1449    4.5 2009-10-27 19:01:04  2009-10-27
...          ...     ...    ...                 ...         ...
27753439  283228    8542    4.5 2013-09-22 17:46:35  2013-09-22
27753440  283228    8712    4.5 2013-09-22 17:45:51  2013-09-22
27753441  283228   34405    4.5 2013-09-22 17:48:09  2013-09-22
27753442  283228   44761    4.5 2012-11-29 01:25:24  2012-11-29
27753443  283228   54286    4.5 2012-11-29 01:28:38  2012-11-29

[27753444 rows x 5 columns]

In [19]:
ratings = spark.sql('SELECT * FROM ratings;').collect()

---
## Tags

In [26]:
spark.table('tags')\
.withColumn('dt', F.to_date(F.col('timestamp')\
                            .cast('bigint')\
                            .cast(dataType=T.TimestampType()), 'yyyy-MM-dd HH:mm:ss') )\
.withColumn('timestamp', F.col('timestamp')\
                            .cast('bigint')\
                            .cast(dataType=T.TimestampType()) )\
.createOrReplaceTempView('tags')

sql = """

SELECT
    *
FROM
    tags

"""


tView(sql, 'tags')
sqlR(sql)

/opt/homebrew/lib/python3.10/site-packages/pyspark/sql/pandas/conversion.py:248: FutureWarning: Passing unit-less datetime64 dtype to .astype is deprecated and will raise in a future version. Pass 'datetime64[ns]' instead
  series = series.astype(t, copy=False)

         userId movieId                 tag           timestamp          dt
0            14     110                epic 2015-09-24 23:35:38  2015-09-24
1            14     110            Medieval 2015-09-24 23:35:32  2015-09-24
2            14     260              sci-fi 2015-09-13 15:36:50  2015-09-13
3            14     260        space action 2015-09-13 15:37:01  2015-09-13
4            14     318        imdb top 250 2015-09-18 19:26:35  2015-09-18
...         ...     ...                 ...                 ...         ...
1108992  283206   73017                 fun 2010-01-24 22:24:19  2010-01-24
1108993  283206   73017  homoerotic subtext 2010-01-24 22:24:18  2010-01-24
1108994  283206   73017              pacing 2010-01-24 22:24:18  2010-01-24
1108995  283206   73017                plot 2010-01-24 22:24:18  2010-01-24
1108996  283221   49651  Sylvester Stallone 2007-01-09 10:47:10  2007-01-09

[1108997 rows x 5 columns]

In [21]:
tags = spark.sql('SELECT * FROM tags;').collect()

---
## Genres

In [22]:
sql = """

WITH E AS (
    SELECT
        movieId
        , publish_year
        , EXPLODE(genres) AS genre
    FROM
        movies
)

, F AS (
    SELECT
        genre
        , publish_year
        , COUNT(DISTINCT movieId) AS movies
    FROM
        E
    GROUP BY
        1,2
    ORDER BY
        2,1
)

SELECT * FROM F

"""


tView(sql, 'genres')
sqlR(sql)

                   genre publish_year  movies
0     (no genres listed)         None     212
1                 Action         None      16
2              Adventure         None       9
3              Animation         None       2
4               Children         None       5
...                  ...          ...     ...
2068             Romance         2018      70
2069              Sci-Fi         2018      70
2070            Thriller         2018     144
2071                 War         2018      11
2072             Western         2018      10

[2073 rows x 3 columns]

In [23]:
genres = spark.sql('SELECT * FROM genres;').collect()

---
## Load ☁️ ===========================

In [24]:
tempViews = {}

tempViews['movies'] = spark.table('movies')
tempViews['tags'] = spark.table('tags')
tempViews['ratings'] = spark.table('ratings')
tempViews['genres'] = spark.table('genres')
tempViews['genome_scores'] = spark.table('genome_scores')
tempViews['genome_tags'] = spark.table('genome_tags')

for df in dfs:
    print(df,'\n |-->', dfs[df], '\n')

links
 |--> DataFrame[movieId: string, imdbId: string, tmdbId: string]

tags
 |--> DataFrame[userId: string, movieId: string, tag: string, timestamp: string]

genome_tags
 |--> DataFrame[tagId: string, tag: string]

ratings
 |--> DataFrame[userId: string, movieId: string, rating: string, timestamp: string]

genome_scores
 |--> DataFrame[movieId: string, tagId: string, relevance: string]

movies
 |--> DataFrame[movieId: string, title: string, genres: string]

In [ ]:
# Helpers to format values

def write_to_file(text, file):
    f = open(file, "w")
    f.write(text)
    f.close()


def strstr(string):
    if "'" in string:
        string = string.replace("'", " ")
    if "[" in string:
        string = string.replace("[", "")
    if "]" in string:
        string = string.replace("]", "")
    if "\\" in string:
        string = string.replace("\\", "")
    if ":" in string:
        string = string.replace(":", " ")
    if "," in string:
        string = string.replace(",", "")

    return f"'{string}'"


def array(arr):
    if len(arr) == 0: return 'null'
    
    format_arr = f"ARRAY {list(map(lambda x: strstr(x), arr))}"
    
    if '"""' in format_arr:
        format_arr = format_arr.replace('"""', '')
    if '"' in format_arr:
        format_arr = format_arr.replace('"', "")
    if "\\" in format_arr:
        format_arr = format_arr.replace("\\", "")
    if ":" in format_arr:
        format_arr = format_arr.replace(":", " ")
    if "''" in format_arr:
        format_arr = format_arr.replace("''", "'")

    return format_arr


def to_int(number):
    if number is None:
        return 'null'
    return int(number)


def to_float(number):
    if number is None:
        return 'null'
    return float(number)


def to_datetime(date):
    return f"'{date.strftime('%Y-%m-%d %H:%M:%S')}'"


def to_date(date):
    return f"'{date.strftime('%Y-%m-%d')}'"

In [ ]:
# Load Movies

format_to_movies = {
    'movieId': to_int,
    'imdbId': to_int,
    'tmdbId': to_int,
    'title': strstr,
    'genres': array,
    'publish_year': to_int,
    'user_tag_amount': to_int,
    'tag_amount': to_int,
    'tags': array,
    'average_rating': to_float,
    'user_review_amount': to_int,
    'review_amount': to_int
}

def format_movie_values(movie):
    return {key:format_to_movies[key](movie[key]) for key in movie.keys()}

with db.connect() as con:
    insert_sql = "INSERT INTO movies (movieId, imdbId, tmdbId, title, genres, publish_year, user_tag_amount, tag_amount, tags, average_rating, user_review_amount, review_amount) \n\tVALUES "
    format_movies = list(map(lambda x: x.asDict(), movies))

    for idx_movie, movie in enumerate(format_movies):
        print(f'---> INSERTING [{idx_movie}]...')
        
        try:
            new_movie = list(format_movie_values(movie).values())

            insert_sql += '('
            for idx, value in enumerate(new_movie):
                insert_sql += f'{value}' + ('' if idx + 1 >= len(new_movie) else ', ')
            insert_sql += ')' + (';' if idx_movie + 1 >= len(format_movies) else ',\n\t')
        except Exception as e:
            print(f'Index error: {idx_movie}')
            print(e)
            
    insert_sql = insert_sql.replace("', ',", "', ")
    write_to_file(insert_sql, "./sql/popula_movies.sql")
        
    con.execute(sqlalchemy.text(insert_sql))
    con.commit()

In [ ]:
# Load Ratings

format_to_movies = {
    'movieId': to_int,
    'imdbId': to_int,
    'tmdbId': to_int,
    'title': strstr,
    'genres': array,
    'publish_year': to_int,
    'user_tag_amount': to_int,
    'tag_amount': to_int,
    'tags': array,
    'average_rating': to_float,
    'user_review_amount': to_int,
    'review_amount': to_int
}

with db.connect() as con:
    print(ratings[0])
#     statement = sqlalchemy.text("""INSERT INTO ratings (userId, movieId, rating, timestamp, dt) VALUES (:userId, :movieId, :rating, :timestamp, :dt)""")
#     format_ratings = list(map(lambda x: x.asDict(), ratings))
#     ratings_to_insert = []
    
#     for rating in format_ratings:
#         str = '('
#         for idx, v in enumerate(rating.values()):
#             str += f"'{v}'"
#             if idx < len(rating.values()) - 1:
#                 str += ', '
#             else: str += ')'
#         ratings_to_insert.append(str)
        
#     try:
#         con.execute(sqlalchemy.text(f"INSERT INTO ratings (userId, movieId, rating, timestamp, dt) VALUES {', '.join(ratings_to_insert)}"))
#     except Exception as e:
#         print(e)
#         print(f'Index error: {idx}')

#     con.commit()
#     print(f'---> {len(ratings_to_insert)} ratings inserted with success!')

In [ ]:
# Load Tags

format_to_tags = {
    'userId': to_int,
    'movieId': to_int,
    'tag': strstr,
    'timestamp': to_datetime,
    'dt': to_date
}

def format_tag_values(tag):
    return {key:format_to_tags[key](tag[key]) for key in tag.keys()}

with db.connect() as con:
    insert_sql = "INSERT INTO tags (userId, movieId, tag, timestamp, dt) \n\tVALUES "
    format_tags = list(map(lambda x: x.asDict(), tags))
    
    for idx_tag, tag in enumerate(format_tags):

        try:
            new_tag = list(format_tag_values(tag).values())
            
            insert_sql += '('
            for idx, value in enumerate(new_tag):
                insert_sql += f'{value}' + ('' if idx + 1 >= len(new_tag) else ', ')
            insert_sql += ')' + (';' if idx_tag + 1 >= len(format_tags) else ',\n\t')

        except Exception as e:
            print(f'Index error: {idx_tag}')
            print(e)
            print(tag)
        
    insert_sql = insert_sql.replace("', ',", "', ")
    write_to_file(insert_sql, "./sql/popula_tags.sql")
        
    con.execute(sqlalchemy.text(insert_sql))
    con.commit()

In [ ]:
# Load Genres

with db.connect() as con:
    format_genres = list(map(lambda x: x.asDict(), genres))
    genres_to_insert = []

    for genre in format_genres[:50]:
        str = '('
        for idx, v in enumerate(genre.values()):
            str += f"'{v}'"
            if idx < len(genre.values()) - 1:
                str += ', '
            else: str += ')'
        genres_to_insert.append(str)
        
    try:
        values = ', '.join(genres_to_insert)
        values = values.replace("'None'", 'null')
        con.execute(sqlalchemy.text(f"INSERT INTO genres (genre, publish_year, movies) VALUES {values}"))
    except Exception as e:
        print(e)
        print(f'Index error: {idx}')

    con.commit()
    print(f'---> {len(genres_to_insert)} genres inserted with success!')

---
### Rascunho

In [ ]:
sql = """

SELECT * FROM movies
--WHERE title LIKE '%(500)%' OR title LIKE '%(69)%'
--WHERE publish_year = ''
--WHERE title LIKE '%Bicycle, Spoon, Apple%'
--OR title LIKE '%Millions Game, The%'
--WHERE publish_year IS NULL
WHERE title IS NULL OR title = ''
LIMIT 327
"""


sqlR(sql)
spark.sql(sql).show(truncate=False,n=327)

In [11]:
sql = """

SELECT
    COUNT(*)
FROM
    genome_tags

"""


sqlR(sql)

   count(1)
0      1128